#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//算数操作符：+ - * / %(取模）
//移位操作符：>> <<
//位操作符： & ^ |
//赋值操作符： = +- -+ *= /= &= ^= |= >>= <<=
//单目操作符


///算数操作符：+ - * / %(取模）
//int main()
//{
//	int a = 5 % 2;//取模（取余数）
//	printf("%d\n", a);
//	return 0;
//}

///移（二进制）位操作符：>> <<
// <<左移 >>右移、
//int main()
//{
//	int a = 1;
//	//整形1占4个字节——32bit
//	//00000000000000000000000000000001
//	int b = a << 1;
//		printf("%d\n", b);
//		printf("%d\n", a);
//	return 0;
//}

///位操作符： & ^ |

//(2进制）位操作
//& 按位与
//| 按位和
//^按位异或

//int main()
//{
//int a = 3;       //011
//int b = 5;       //101
////int c = a&b;   //001(数位同时为真才能是真）
////int c = a | b; //111(数位有一个为真就是真）
////int c = a ^ b; //110（对应的二进制相同则为0，相异则为1）
//printf("%d\n", c);
//return 0;
//}

///赋值操作符： = +- -+ *= /= &= ^= |= >>= <<=
//int main()
//{
//	int a = 10; // = 赋值  ==判断相等
//	a = a + 10; //1
//	a += 10;    //2（写法完全等价）
//	a = a - 20;
//	a -= 20;
//	a = a & 2;
//	a &= 2;
//	//复合赋值符
//}

///单目操作符   !(逻辑反操作） -（负值） +（正值） &（取地址） sizeof(操作数的类型长度（以字节为单位）
///双目操作符   ~(对一个数的二进制按位取反） --（前置，后置--） ++(前置，后置++）
///三目操作符   *（间接访问操作符（解引用操作符）） （类型）强制类型转换

//int main()
//{
	//int a = 10;
	//int b = 20;
	//a + b; // + 双目操作符（有两个操作数）
	//C语言中我们要表示真假
	//0表示假，非0表示真
	//int a = 0;
	//printf("%d\n", a);
	//printf("%d\n", !a);
	//return 0;
//}

	//int main()
	//{
	//	//	int a = 10;
	//	//	//sizeof 计算的是变量/类型所占空间的大小，单位是字节
	//	//	printf("d\n", sizeof(a)); //4字节
	//	//	printf("d\n", sizeof(int));
	//	//	printf("d\n", sizeof a);
	//	//	//printf("d\n", sizeof int);
	//	//	return 0;
	//	//}

int main()
{
		int arr[10] = { 0 };//10个整形元素的数组
		int sz = 0;
		//10 * sizeof(int) = 40;
		printf("%d\n", sizeof (arr));
		//计算数组的元素个数
		//个数=数组总大小/每个元素大小
		sz = sizeof(arr) / sizeof (arr[0]);
		printf("%d\n", sz);
		return 0;
	}